Repository: foxoman/switch
Catalog: po/*.po
Languages: de, it

source: About
de: Über
it: Informazioni su

source: A simple game about linear equations
de: Ein einfaches Spiel über Matrizen
it: Un semplice gioco sulle equazioni lineari

source: Credits
de: Danksagungen
it: Crediti

source: Many thanks to <a href='%1'>Andrew Penkrat</a> for his help and contribution ensuring Switch generates systems with one and only one solution 😉.
de: Vielen Dank an <a href='%1'>Andrew Penkrat</a> für seine Hilfe und seinen Beitrag, damit Switch nur Gleichungssysteme mit einer und wirklich nur einer Lösung generiert 😉.
it: Molte grazie a <a href='%1'>Andrew Penkrat</a> per il suo aiuto ed il contributo affinchè Switch generi sistemi con una ed una sola soluzione 😉.

source: Thanks to <a href='%1'>Stuart Langridge</a> for testing, design input and QA.
de: Vielen Dank an <a href='%1'>Stuart Langridge</a> für Designideen, testen und Qualitätssicherung.
it: Grazie a <a href='%1'>Stuart Langridge</a> per le prove, i suggerimenti per la grafica ed i controlli di qualità.

source: Thanks to <a href='%1'>Sam Hewitt</a> for creating the <a href='%2'>Ubuntu Icon Resource Kit</a> which was used to create the application icon.
de: Vielen Dank an <a href='%1'>Sam Hewitt</a> für die Erstellung des <a href='%2'>Ubuntu Icon Resource Kit</a>, das als Vorlage für das Anwendungssymbol diente.
it: Grazie a <a href='%1'>Sam Hewitt</a> per aver creato <a href='%2'>Ubuntu Icon Resource Kit</a> che ho usato per creare l'icona dell'applicazione.

source: License and Copyright
de: Lizenz und Copyright
it: Licenza e Copyright

source: Source code available on <a href='%1'>GitHub</a>.
de: Quellcode auf <a href='%1'>GitHub</a> verfügbar.
it: Codice sorgente disponibile su <a href='%1'>GitHub</a>.

source: Rate
de: Bewerten
it: Valuta

source: Report bug
de: Bug melden
it: Segnala errori

source: Contribute
de: Mitwirken
it: Contribuisci

source: Nevermind, moving on!
de: Macht nichts, weiter so!
it: Non importa, vai avanti!

source: Don't worry!
de: Ärgere dich nicht!
it: Non ti preoccupare!

source: Keep your head up!
de: Kopf hoch!
it: Su con il morale!

source: Hold your head up!
de: Kopf hoch!
it: Su con la testa!

source: Go on!
de: Mach weiter!
it: Vai avanti !

source: Failure
de: Fehler
it: Fallimento

source: %1/%2 correct
de: %1/%2 richtig
it: %1/%2 corretto

source: <b>Your solution</b>: %1
de: <b>Deine Lösung</b>: %1
it: <b>La tua soluzione</b>: %1

source: <b>Correct solution</b>: %1
de: <b>Korrekte Lösung</b>: %1
it: <b>Soluzione corretta</b>: %1

source: Tap anywhere to continue
de: Klicke irgendwohin, um fortzufahren.
it: Tocca ovunque per continuare

source: Back to game
de: Zurück zum Spiel
it: Torna al gioco

source: You made it!
de: Geschafft!
it: Ce l'hai fatta!

source: Thanks so much for playing.
de: Vielen Dank fürs spielen!
it: Grazie molte per aver giocato

source: Help
de: Hilfe
it: Aiuto

source: What is Switch?
de: Was ist Switch?
it: Che cos'è Switch?

source: Switch is a game about solving systems of linear equations using the Gaussian elimination of matrices.
de: Switch ist ein Spiel über das Lösen von linearen Gleichungssystemen mit Hilfe des Gauß-Verfahren.
it: Switch è un gioco che consiste nel risolvere sistemi di equazioni lineari utilizzando la semplificazione Gaussiana delle matrici

source: WTF?
de: Seids narrisch?
it: Cosa ??!!!

source: Errrm, yeah 😄
de: Ähm, ja 😄
it: ehm... esatto! 😄

source: Actually, I'm not sure if you can call this 'a game' at all ...
de: Ich bin mir eigentlich nicht sicher, ob man das wirklich ein 'Spiel' nennen kann ...
it: A dire il vero, non sono sicuro che tutti possano definirlo 'un gioco' ...

source: However, if you're a student and you want to practise the Gaussian elimination algorithm a bit this app can help you.
de: Wie auch immer, wenn du ein Schüler bist und das Gauß-Verfahren üben möchtest, kann diese Anwendung dir helfen.
it: Tuttavia, se sei uno studente e vuoi fare pratica con l'algoritmo di eliminazione di Gauss questa applicazione può esserti un po' di aiuto.

source: You could also see this as a refreshingly different way to prepare for an exam 😉. It's basically up to you to define this app's purpose.
de: Du könntest es als einen erfrischend anderen Weg sehen, dich auf eine Prüfung vorzubereiten 😉. Es liegt an dir, den Sinn dieser Anwendung zu definieren.
it: Si potrebbe anche vedere come un modo alternativo e simpatico per preparare un esame 😉. Spetta fondamentalmente a voi definire lo scopo di questa applicazione.

source: Of course, if you're not a student, Switch can still be a good way to train your mathematical skills.
de: Und auch wenn du kein Schüler bist, kannst du mit Switch deine Mathe-Skills auffrischen.
it: Naturalmente, se non sei uno studente, Switch può essere un buon modo per allenare le proprie abilità matematiche.

source: OMG seriously?! Get me out of here!
de: OMG ernsthaft?! Hilf mir hier raus!
it: Oh mio Dio, seriamente? Portami via da qui !

source: How does it work?
de: Wie macht man's?
it: Come funziona?

source: Show the tutorial
de: Öffne Tutorial
it: Mostrami il tutorial

source: Spoon boy
de: Junge mit Löffel
it: Bimbo & cucchiaio

source: There is no spoon.
de: Es gibt keinen Löffel.
it: Il cucchiaio non esiste.

source: So that's why chicken tastes like everything.
de: Wenn du die Augen zumachst, schmeckt es fast wie rohe Eier!
it: Di pollo, oggi, sanno tante cose

source: You need to unplug, man.
de: Du brauchst mal 'ne Auszeit!
it: Dovresti staccare la spina

source: Dodge this.
de: Nur eine Maschine.
it: Schiva questa!

source: Ignorance is bliss.
de: Unwissenheit ist ein Segen.
it: L'ignoranza è un bene.

source: Our way... or the highway.
de: Du steigst ein oder Du steigst aus.
it: O la nostra via... o vai fuori dai piedi!

source: The Matrix is everywhere.
de: Die Matrix ist ein System, Neo.
it: Matrix è ovunque.

source: Agent Smith
it: Agente Smith

source: Never send a human to do a machine's job.
de: Nimm nie einen Menschen, wenn du eine Maschine dafür nehmen kannst.
it: Mai mandare un essere umano a fare il lavoro di una macchina.

source: Whoa. Déjà vu.
de: Ein Déjà vu.
it: Ah. Déjà vu.

source: Merovingian
de: Merowinger
it: Merovingio

source: I love the French language.
de: Ich liebe französischen Wein.
it: Amo la lingua francese

source: Oracle
de: Orakel
it: Oracolo

source: I love candy.
de: Ich liebe Süßigkeiten.
it: Sono golosa di dolci.

source: The Architect
de: Der Architekt
it: L'Architetto

source: I've been waiting for you.
de: Ich habe auf dich gewartet.
it: Ti stavo aspettando.

source: Level '%1'
it: Livello '%1'

source: Back
de: Zurück
it: Indietro

source: Generate new
de: Neu erstellen
it: Genera nuovo

source: Surrender
de: Kapitulation
it: Resa

source: Solve
de: Lösen
it: Risolvi

source: Stats
de: Statistik
it: Statistiche

source: Locked
de: Gesperrt
it: Bloccato

source: Earn all stars in previous levels to unlock.
de: Verdiene alle Sterne in den vorherigen Leveln.
it: Guadagna tutte le stelle nei livelli precedenti per sbloccare.

source: Move the slider to multiply
de: Multiplizieren
it: Muovi il cursore per moltiplicare

source: Hide
de: Verstecken
it: Nascondi

source: Matrices solved: %1
de: Matrizen gelöst: %1
it: Matrici risolte: %1

source: Failure count: %1
de: Fehlerzahl: %1
it: Conteggio errori: %1

source: Success rate: %1%
de: Erfolgsrate: %1%
it: Percentuale di successo: %1%

source: Success
de: Erfolg
it: Successo

source: Matrix solved.
de: Matrix gelöst.
it: Matrice risolta

source: Solution: %1
it: Soluzione: %1

source: Solve %1 more to complete the level.
de: Löse noch %1, um das Level abzuschließen.
it: Risolvine ancora %1 per completare il livello.

source: <b>Level '%1' unlocked.</b>
de: <b>Level '%1' entsperrt.</b>
it: <b>Livello '%1' sbloccato.</b>

source: Hey! Welcome to Switch.
de: Willkommen zu Switch!
it: Hey! Benvenuto in Switch.

source: Yeah, I know. That sounds scary. It doesn't really sound like a lot of fun, rather like one of <i>those</i> maths lessons, right? 😉
de: Ja, ich weiß. Das klingt schrecklich. Es klingt nicht nach besonders viel Spaß, eher nach einer <i>dieser</i> Mathestunden, richtig? 😉
it: Si, lo so; suona spaventoso. In realtà non sembra un gran divertimento, un po' come una di <i> quelle</i> lezioni di matematica, giusto? 😉

source: ”Then let us hope that I was wrong”
de: ”Dann lass uns hoffen, dass ich falsch lag”
it: "Allora speriamo che mi sia sbagliato"

source: What is the matrix?
de: Was ist die Matrix?
it: Cos'è Matrix?

source: ”The answer is out there, Neo. It's looking for you, and it will find you if you want it to.”
de: Die Antwort ist irgendwo da draußen, sie ist auf der Suche nach dir und sie wird dich finden, wenn DU es willst.
it: La risposta è intorno a te, Neo. E ti sta cercando. E presto ti troverà, se tu lo vorrai.

source: The matrices in Switch are matrices of coefficients of associated systems of linear equations. Consider the following linear system:
de: Die Matrizen in Switch sind Koeffizientenmatrixen eines zugehörigen linearen Gleichungssystems. Stelle dir folgendes lineare Gleichungssystem vor:
it: Le matrici, in Switch, sono matrici di coefficienti associati a sistemi di equazioni lineari. Considera il seguente sistema lineare:

source: Now we're removing all the clutter ...
de: Jetzt entfernen wir den überflüssigen Teil ...
it: Ora rimuoviamo tutto il disordine ...

source: ... and we get a matrix form like the one above.
de: ... und wir erhalten eine Matrixform wie die obige.
it: ... e otteniamo una forma di matrice come quella sopra .

source: Solution?
de: Lösung?
it: Soluzione?

source: In Switch, all matrices have exactly one correct solution.
de: In Switch haben alle Matrizen genau eine Lösung.
it: In Switch, tutte le matrici hanno una sola soluzione.

source: A solution is an assignment of values to the variables (x, y) such that all equations are correct.
de: Eine Lösung ist die Menge der Werte der Variablen (x, y), die das Gleichungssystem eindeutig lösen.
it: La soluzione è assegnare dei valori alle variabili (x, y) in modo tale che tutte le equazioni siano corrette.

source: In our case the solution x=2, y=1 satisfies the linear system.
de: In unserem Fall löst die Lösung x=2, y=1 das Gleichungssystem.
it: Nel nostro caso la soluzione x = 2, y = 1 soddisfa il sistema lineare.

source: How to solve a matrix
de: Das Lösen einer Matrix
it: Risolvere una matrice

source: There are multiple ways to solve a system of linear equations.
de: Es gibt mehrere Ansätze, ein lineares Gleichungssystem zu lösen.
it: Ci sono molti metodi per risolvere sistemi di matrici lineari.

source: In Switch you will use <a href='https://en.wikipedia.org/wiki/Gaussian_elimination'>Gaussian elimination</a>, also known as row reduction.
de: In Switch wirst du das <a href='https://de.wikipedia.org/wiki/Gau%C3%9Fsches_Eliminationsverfahren'>Gaußsche Eliminationsverfahren</a> oder kurz Gauß-Verfahren anwenden.
it: In Switch userai il <a href='https://it.wikipedia.org/wiki/Metodo_di_eliminazione_di_Gauss'>Metodo di eliminazione di Gauss</a>, conosciuto anche come MEG.

source: Using the Gaussian elimination algorithm you can perform several actions on a matrix of coefficients.
de: Im Zuge des Gauß-Verfahren kannst du mehrere Operationen auf eine Koeffizientenmatrix anwenden.
it: Usando l'algoritmo di eliminazione di Gauss è possibile eseguire diverse azioni su una matrice di coefficienti.

source: Those actions are called row operations. In Switch you are able to ...
de: In Switch kannst du somit ...
it: Tali azioni sono chiamate operazioni di riga. In Switch si è in grado di ...

source: ... multiply a row by a number
de: ... eine Zeile mit einer Zahl multiplizieren
it: ... Moltiplicare una riga per un numero

source: ... add one row to another
de: ... eine Zeile auf einen andere addieren
it: ... addizionare una riga ad un'altra

source: The goal of all this is to eliminate variables by setting the coefficient to zero. Remember our example:
de: Dabei ist es das Ziel, Variablen zu eliminieren, indem der Koeffizient gleich Null gesetzt wird. Nehmen wir unser Beispiel zur Hand:
it: L'obiettivo di tutto questo è quello di eliminare variabili, portando il coefficiente a zero. Ricorda il nostro esempio:

source: To solve this matrix, we would like to eliminate the x variable from the second row.
de: Um diese Matrix zu lösen, wollen wir die x-Variable aus der zweiten Zeile eliminieren.
it: Per risolvere questa matrice, dobbiamo eliminare la variabile x dalla seconda fila.

source: To achieve this, we'll multiply the first row by -1 and add it to the second row. The result:
de: Dazu multiplizieren wir die erste Zeile mit -1 und addieren sie auf die zweite Zeile. Das Ergebnis:
it: Per raggiungere questo obiettivo, moltiplichiamo la prima fila per -1 e la aggiungiamo alla seconda fila. Il risultato è:

source: In this simple case, this was the only step needed to solve the system.
de: In diesem einfachen Beispiel war das der einzige Schritt, der nötig war, um das System zu lösen.
it: In questo caso semplice, questo era l'unico passo necessario per risolvere il sistema.

source: Our matrix is transformed into upper <a href='https://en.wikipedia.org/wiki/Triangular_matrix'>triangular form</a>, which means that all matix entries below the <a href='https://en.wikipedia.org/wiki/Main_diagonal'>main diagonal</a> are zero.
de: Unsere Matrix ist in der <a href='https://de.wikipedia.org/wiki/Dreiecksmatrix'>Dreiecksform</a>. Das bedeutet, dass alle Einträge unter der <a href='https://de.wikipedia.org/wiki/Hauptdiagonale'>Hauptdiagonalen</a> gleich Null sind.
it: La nostra matrice è trasformata in <a href='https://it.wikipedia.org/wiki/Matrice_triangolare'> forma triangolare </a>, come sopra, il che significa che tutte le entità sotto la <https a href = 'https://it.wikipedia.org/wiki/Diagonale_principale'>diagonale principale</a> sono pari a zero.

source: We can now finish solving the matrix in your head:
de: Du kannst nun den Rest im Kopf lösen:
it: Ora possiamo concludere, risolvendo a mente la matrice:

source: Therefore: x = 2, y = 1
de: Somit: x = 2, y = 1
it: Quindi: x = 2, y = 1

source: Alternatively we can continue to simplify the matrix using the row operations ...
de: Alternativ können wir weiter die Matrix vereinfachen, indem wir die Operationen anwenden ...
it: In alternativa, possiamo continuare a semplificare la matrice usando le operazioni in riga...

source: ... until we end up with the so called reduced <a href='https://en.wikipedia.org/wiki/Row_echelon_form'>row echelon form</a>.
de: ... bis wir die sogenannte reduzierte <a href='https://de.wikipedia.org/wiki/Lineares_Gleichungssystem#Stufenform.2C_Treppenform'>Stufenform</a> erreicht haben.
it: ... fino a quando si arriva a ciò che è definito <a href='https://it.wikipedia.org/wiki/Metodo_di_eliminazione_di_Gauss'> riduzione a scalini</a>.

source: This means that in every row there is exactly one leading coefficient which is 1.
de: Das bedeutet, dass in jeder Zeile exakt ein Leitkoeffizient gleich 1 besteht.
it: Ciò significa che in ogni riga c'è esattamente un coefficiente di guida che è 1.

source: All other entries in the same column are 0.
de: Alle andere Einträge in derselben Spalte sind Null.
it: Tutte le altre voci nella stessa colonna sono 0.

source: And ... action
de: Und los
it: E.... via!

source: In Switch, this all is even more hassle-free. I think it's time to try it yourself.
de: In Switch ist das alles viel einfacher. Es ist Zeit, dass du es selbst ausprobierst.
it: In Switch, tutto questo è ancora più facilitato. Penso che sia il momento che tu provi da solo.

source: Row operations:
de: Zeilenoperationen:
it: Operazioni di riga

source: Add
de: Addieren
it: Somma

source: • You can drag and drop a row onto another to add it
de: • Du kannst eine Zeile drücken, ziehen und auf eine andere fallen lassen, um sie zu addieren
it: • È possibile trascinare e rilasciare una riga sopra un'altra per aggiungerla

source: Multiply
de: Multiplizieren
it: Multipli

source: • Tap on a row to select it
de: • Drücke auf eine Zeile, um sie auszuwählen
it: • Tocca la riga per selezionarla

source: • The multiply header will show
de: • Die Multiplizier-Funktion wird angezeigt
it: • Apparirà lo strumento di moltiplicazione

source: • Hold and move the slider increase/decrease the value of the mutliplicator, release to multiply
de: • Bewege den Schieberegler, um den Wert des Faktors zu vergrößern oder zu verkleinern. Lasse los, um zu multiplizieren
it: • Tocca e trascina il cursore per aumentare / diminuire il valore della moltiplicazione, al rilascio sarà mostrato il risultato

source: In Switch, there are two ways to solve a matrix:
de: In Switch kannst du eine Matrix auf zwei Arten lösen:
it: In Switch, ci sono due modi per risolvere le matrici:

source: 1. Transform the matrix into upper <a href='https://en.wikipedia.org/wiki/Triangular_matrix'>triangular form</a> using the row operations.
de: 1. Bringe die Matrix in die <a href='https://de.wikipedia.org/wiki/Dreiecksmatrix'>Dreiecksform</a>, in dem du die Zeilenoperationen anwendest.
it: 1. Trasforma la matrice nella soprastante <a href='https://it.wikipedia.org/wiki/Matrice_triangolare'>forma triangolare</a>usando le operazioni di riga.

source: Click on the 'Solve' button when you think you know the solution.
de: Klicke auf den 'Lösen'-Knopf, wenn du denkst, dass du die Lösung weißt.
it: Cliccare sul pulsante 'Soluzione' quando si pensa di conoscere la soluzione.

source: ⊕ time efficient for small matrices
de: ⊕ Zeiteffizient für kleine Matrizen
it: ⊕ Efficienta il tempo di calcolo per le piccole matrici

source: ⊕ train your mental arithmetic skills
de: ⊕ Übe dich im Kopfrechnen
it: ⊕ allena le tue abilità aritmetiche mentali

source: ⊖ difficult for bigger matrices
de: ⊖ schwierig für größere Matrizen
it: ⊖ difficile per le matrici più grandi

source: ↳ recommended for smaller matrices
de: ↳ Empfohlen für kleine Matrizen
it: ↳ consigliato per le matrici più piccole

source: 2. Simplify the matrix as much as possible by using the row operations.
de: 2. Vereinfache die Matrix bis es nicht mehr geht.
it: 2. Semplificare la matrice il più possibile usando le operazioni di riga.

source: You will end up with the so called reduced <a href='https://en.wikipedia.org/wiki/Row_echelon_form'>row echelon form</a> and Switch will detect that the matrix is solved.
de: Du wirst in der bereits erwähnten, reduzierten<a href='https://de.wikipedia.org/wiki/Lineares_Gleichungssystem#Stufenform.2C_Treppenform'>Stufenform</a> enden und Switch wird erkennen, dass die Matrix gelöst ist.
it: Ti troverai con la cosiddetta forma ridotta <a href='https://it.wikipedia.org/wiki/Metodo_di_eliminazione_di_Gauss#Matrice_a_scalini'>a scalini</a> e Switch rileverà che la matrice è risolta.

source: ⊕ easy on the brain (no need for mental arithmetic)
de: ⊕ verhältnismäßig einfach (kein Kopfrechnen nötig)
it: ⊕ facile a mente (senza bisogno di calcoli mentali)

source: ⊖ wastefully time consuming for smaller matrices
de: ⊖ unnötig zeitaufwendig für kleinere Matrizen
it: ⊖ dispendiosa in termini di tempo per le matrici più piccole

source: ↳ recommended for big matrices
de: ↳ Empfohlen für große Matrizen
it: ↳ consigliato per le matrici più grandi

source: ”The problem is choice.”
de: ”Das Problem ist die Entscheidung.”
it: ”Il problema è scegliere.”

source: Let's go
de: Los geht's
it: Andiamo!

source: I think it's time to try it yourself.
de: Ich denke es ist Zeit, dass du es selbst ausprobierst.
it: Penso che sia il momento che tu provi da solo.

source: As soon as you think you got it, you can <a href='#'>check your solution</a>.
de: Sobald du die Lösung weißt, <a href='#'>überprüfe</a>.
it: Appena pensi di aver completato, puoi <a href='#'>verificare la soluzione</a>.

source: Or, alternatively, simplify it to the very end and Switch will handle the rest.
de: Alternativ kannst du die Matrix bis zum Ende vereinfachen und Switch erledigt den Rest.
it: Oppure, in alternativa, semplificare fino alla fine e Switch si occuperà del resto.

source: <u>Hint:</u> The variables in Switch are called X1, X2, X3 ... XN (e.g. instead of x, y, z).
de: <u>Hinweis:</u> Die Variablen in Switch lauten X1, X2, X3 ... XN (nicht z.B. x, y, z).
it: <u>Suggerimento:</u> Le variabili in switch sono chiamate X1 , X2 , X3 ... XN (es. al posto di x , y , z ).

source: The reason for this is simply that there will be more than just 3 variables in the game and this naming scheme is more consistent therefore.
de: Der Grund dafür ist, dass es in dem Spiel einfach mehr als nur 3 Variablen gibt und die Benennung ist so konsistenter.
it: La ragione di questo è semplicemente il fatto che ci saranno più 3 variabili in gioco e questo schema è conseguentemente più coerente.

source: No idea what to do? <a href='#'>Go back to the explanations</a>.
de: Kein Plan? <a href='#'>Schau dir nochmal die Erklärungen an</a>.
it: Non hai idea di cosa fare? <a href='#'> Torna alla spiegazione </a>.

source: Success!
de: Erfolg!
it: Risolto!

source: Are you ready for more?
de: Bereit für mehr?
it: Sei pronto per continuare?

source: Continue
de: Weiter
it: Continua

source: This is not the correct solution. Try again!
de: Das ist nicht die richtige Lösung. Versuch es nochmal!
it: Non è la soluzione corretta. Riprova!
